In [1]:
import pandas as pd
import numpy as np
from numpy.random import randn

In [2]:
data = pd.read_csv('example.csv')

In [3]:
data

   1  13  21  11  196  75  4   3  34  6  7  8  0  1.1  2  3.1  4.1   5
0  3  42  12  33  766  75  4  55   6  4  3  4  5    6  7    0   11  12
1  1  22  33  11  999  11  2   1  78  0  1  2  9    8  7    1   76  88

##### Write to file

In [4]:
data.to_csv('example_output.csv')

In [5]:
data2 = pd.DataFrame(randn(5, 4), index = 'A B C D E'.split(), columns='W X Y Z'.split())

In [6]:
data2

          W         X         Y         Z
A  0.000021 -0.762213  0.248515 -1.332295
B  0.697806 -0.758500  0.883949 -0.861151
C -1.607520  0.676198  0.350315  1.147417
D  0.212555 -1.065164 -1.669340  0.146452
E -0.927272  1.131268  1.206627 -0.863592

In [7]:
data2['new'] = data2['W'] + data2['Y']

In [8]:
data2

          W         X         Y         Z       new
A  0.000021 -0.762213  0.248515 -1.332295  0.248536
B  0.697806 -0.758500  0.883949 -0.861151  1.581755
C -1.607520  0.676198  0.350315  1.147417 -1.257205
D  0.212555 -1.065164 -1.669340  0.146452 -1.456785
E -0.927272  1.131268  1.206627 -0.863592  0.279355

In [9]:
data2[data2 > 0]

          W         X         Y         Z       new
A  0.000021       NaN  0.248515       NaN  0.248536
B  0.697806       NaN  0.883949       NaN  1.581755
C       NaN  0.676198  0.350315  1.147417       NaN
D  0.212555       NaN       NaN  0.146452       NaN
E       NaN  1.131268  1.206627       NaN  0.279355

In [10]:
data2 = data2[data2 > 0]

In [11]:
data2

          W         X         Y         Z       new
A  0.000021       NaN  0.248515       NaN  0.248536
B  0.697806       NaN  0.883949       NaN  1.581755
C       NaN  0.676198  0.350315  1.147417       NaN
D  0.212555       NaN       NaN  0.146452       NaN
E       NaN  1.131268  1.206627       NaN  0.279355

In [12]:
data2['Y'] = data2['Y'].fillna(value=data2['W'].median())

In [14]:
data2 = data2.fillna(value=0)

In [15]:
data2

          W         X         Y         Z       new
A  0.000021  0.000000  0.248515  0.000000  0.248536
B  0.697806  0.000000  0.883949  0.000000  1.581755
C  0.000000  0.676198  0.350315  1.147417  0.000000
D  0.212555  0.000000  0.212555  0.146452  0.000000
E  0.000000  1.131268  1.206627  0.000000  0.279355

In [22]:
data3 = pd.DataFrame(
{
'column1': [1, 2, 3],
'column2': ['x', 'y', 'z'],
'column3': [0.19450, 871.2848, 2.19539]
}
)

In [23]:
data3.head(2)

   column1 column2   column3
0        1       x    0.1945
1        2       y  871.2848

In [24]:
data3.sort_values(by='column3')

   column1 column2    column3
0        1       x    0.19450
2        3       z    2.19539
1        2       y  871.28480

In [25]:
del data3['column2']

In [26]:
data3

   column1    column3
0        1    0.19450
1        2  871.28480
2        3    2.19539

In [31]:
df4 = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [32]:
data4 = pd.DataFrame(df4)

In [34]:
data4.head()

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243

In [35]:
data4_comp = data4.groupby('Company')

In [37]:
data4_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0